/* Первое задание */
const tempCel = 30;
const tempFah = (9 / 5) * tempCel + 32;
alert(tempFah);

/* Второе задание */
const name = 'Василий'
var admin = name
console.log(admin)

/* Третье задание */
console.log(1000 + '108') // Конкатенация строк, "+" не выполняет сложения
console.log(1000 - '108') // Вычитанияе, "-" выполняет вычитание, строка преобразуется в число

/* Четвёртое задание */
// <script defer src =....> - атрибут позволяет обработку страницы, не дожидаясь загрузки скрипта
// <script async src =....> - атрибут полностью независим, загрузится и выполнится, страница и другие скрипты не связаны
